#+TITLE: CMPUT 466 Assignment 2
#+AUTHOR: Arun Woosaree
#+OPTIONS: toc:nil num:nil
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_CLASS_OPTIONS: [letterpaper]
#+LATEX_HEADER: \theoremstyle{definition}
#+LATEX_HEADER: \newtheorem{definition}{Definition}[section]

#+begin_src elisp :exports none
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-minted-options '(("linenos" "true"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
#+end_src

#+RESULTS:
| pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f |

** c) \(f: \mathbb{R}^2 \to \mathbb{R}\)
#+begin_src python :exports both :results output verbatim
import numpy as np
from numpy import linalg as LA
# in a) and b) we found the values 2 and 2 in the Hessian matrix
# -4 is obtained because del/ (del x_1 del_x2) f(x_1, x_2) = -4
# same for del/ (del x_2 del_x1) because the matrix is symmetric
H = np.array([
    [2, -4],
    [-4, 2]
            ])
eigenval, eigenvec = LA.eig(H)
print(f"eigenval: {eigenval} | eigenvector: {eigenvec} ")

if any(map(lambda x: x < 0, eigenval)):
    print("Because one of the eigenvalues are negative, we conclude that the function is not convex")
else:
    print("Because all of the eigenvalues are positive, we conclude that the function is convex")
#+end_src

#+RESULTS:
: eigenval: [ 6. -2.] | eigenvector: [[ 0.70710678  0.70710678]
:  [-0.70710678  0.70710678]]
: Because one of the eigenvalues are negative, we conclude that the function is not convex
